import styles from "../styles/pages/home.module.scss";
import type { Metadata } from "next";
import { Header } from '../components/Header';

export const metadata: Metadata = {
  title: "Навчальні Завдання для Школярів",
  description: "Мотиваційні завдання для розвитку важливих навичок у школярів. Вивчай, твори та розвивайся з нами!",
  keywords: "Англійська мова, Математика, Читання, Письмо, Творчість, Завдання для школярів, Розвиток навичок, Навчання"
};

export default function Home() {
  return (
    <div className={styles.wrapper}>
      <Header title='Навчання може бути цікавим!' />
      <main className={styles.main}>
        <p><b>Навчання</b> — це захоплюючий процес, який відкриває безмежні можливості для твого особистісного розвитку та майбутнього. Кожен новий крок у вивченні нових предметів дозволяє тобі отримувати нові знання та навички, які можуть змінити твоє життя. Не бійтеся викликів, адже кожна маленька перемога наближає вас до великих досягнень!</p>
        <div className={styles['container-card']}>
          <p className={`${styles.card} ${styles['card-element1']}`}><strong>Англійська мова</strong><br /> - відкриває безмежні двері в світ спілкування та нових можливостей, дозволяючи тобі не лише зрозуміти інші культури, але й долати кордони між людьми з різних куточків світу. Володіння англійською мовою — це ключ до міжнародних подорожей, кар'єрних можливостей та доступу до безлічі навчальних ресурсів!</p>
          <p className={`${styles.card} ${styles['card-element2']}`}><strong>Математика</strong><br /> — це не лише наука про числа та формули, це школа логічного мислення, яка вчить тебе аналізувати та вирішувати проблеми, що виникають у реальному житті. Завдяки математичним навичкам можна знайти рішення в найрізноманітніших ситуаціях, від фінансів до інженерії, а також розвивати здатність до критичного мислення.</p>
          <p className={`${styles.card} ${styles['card-element3']}`}><strong>Читання</strong><br /> — це справжня подорож у світ нових ідей, знань та емоцій. Воно розвиває уяву, збагачує внутрішній світ та дозволяє побачити різні аспекти життя через призму інших людей. Читання допомагає розширювати горизонти, поглиблювати розуміння світу та дає можливість доторкнутися до мудрості, накопиченої віками.</p>
          <p className={`${styles.card} ${styles['card-element4']}`}><strong>Гарне письмо</strong><br /> — це мистецтво, яке дозволяє чітко та виразно передавати свої думки, ідеї та почуття. Вміння писати правильно і творчо не лише покращує комунікацію, але й розвиває креативність, допомагає організувати думки та створювати цікаві й запам’ятовувані тексти, що можуть надихати інших.</p>
          <p className={`${styles.card} ${styles['card-element5']}`}><strong>Творчість та ручна праця</strong><br /> — це чудовий спосіб розвивати уяву, покращувати дрібну моторику та виражати свої почуття через мистецтво. Виготовлення різноманітних предметів своїми руками приносить не тільки задоволення, але й дає відчуття гордості за свою працю, а також допомагає розвивати уважність та терпіння.</p>
        </div>
      </main>
    </div>
  );
}
